ЛИС2/src/Documents/лис_ОтметкаМестонахожденияЛабораторногоОборудования/лис_ОтметкаМестонахожденияЛабораторногоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>лис_ОтметкаМестонахожденияЛабораторногоОборудования</name>
  <registerRecords>InformationRegister.лис_МестонахождениеЛабораторногоОборудования</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовоеМестонахождение</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
</mdclass:Document>

ЛИС2/src/InformationRegisters/ЛабораторноеОборудованиеВЭксплуатации/ЛабораторноеОборудованиеВЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛабораторноеОборудованиеВЭксплуатации</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДопустимойЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаводскоеОбозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПаспортаНаОборудование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзготовления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/Documents/лис_ОтметкаМестонахожденияЛабораторногоОборудования/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Лаборатория) Тогда		
		Элементы.ВыбратьОборудование.Доступность = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Лаборатория") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры);
		Регистратор = Параметры.Регистратор;
		Элементы.ВыбратьОборудование.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОборудование(Команда)
	
	ПараметрыФормы = СформироватьСтруктуруПараметров();
	ОткрытьФорму("РегистрСведений.ЛабораторноеОборудованиеВЭксплуатации.Форма.ФормаВыбораОборудования",ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция СформироватьСтруктуруПараметров()
	
	ПараметрыФормы = Новый Структура("Организация, Лаборатория", Объект.Организация, Объект.Лаборатория);
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Объект.Оборудование = Параметр.Оборудование;
	Объект.РегистрационныйНомер = Параметр.РегистрационныйНомер;
	Объект.ИнвентарныйНомер = Параметр.ИнвентарныйНомер;
	Объект.ЗаводскойНомер = Параметр.ЗаводскойНомер;
		
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Лаборатория) Тогда		
		Элементы.ВыбратьОборудование.Доступность = Истина;
	Иначе
		Элементы.ВыбратьОборудование.Доступность = Ложь;
		Объект.Оборудование = ПредопределенноеЗначение("Справочник.лис_ЛабораторноеОборудование.ПустаяСсылка");
		Объект.ИнвентарныйНомер = "";
		Объект.РегистрационныйНомер = "";
		Объект.ЗаводскойНомер = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛабораторияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Лаборатория) Тогда		
		Элементы.ВыбратьОборудование.Доступность = Истина;
	Иначе
		Элементы.ВыбратьОборудование.Доступность = Ложь;
		Объект.Оборудование = ПредопределенноеЗначение("Справочник.лис_ЛабораторноеОборудование.ПустаяСсылка");
		Объект.ИнвентарныйНомер = "";
		Объект.РегистрационныйНомер = "";
		Объект.ЗаводскойНомер = "";
	КонецЕсли;
	
КонецПроцедуры
